In [1]:
import sqlite3
from itertools import groupby

import pandas as pd

# 1. Create a connection to the database file
# Make sure 'loan_data.db' is in the same folder as your notebook
conn = sqlite3.connect('loan_data.db')

# 2. Write your SQL query
query = "SELECT * FROM loans WHERE loan_id = 'LOAN-251130-6613'"

# 3. Load into a DataFrame
df = pd.read_sql(query, conn)

# 4. Close the connection (Good practice!)
conn.close()

# 5. View the data
df.head()

,car_make,car_value,car_age_months,car_mileage,finance_amount,flat_rate_percent,term_months,contract_date,term_years,total_interest,total_amount_payable,monthly_repayment,loan_id
0,Tesla Model 3,48000.0,12.0,9800,40000.0,4.2,72,2025-11-30,6.0,10080.0,50080.0,695.56,LOAN-251130-6613

In [2]:
conn = sqlite3.connect('loan_data.db')

query = "SELECT * FROM repayment_schedules WHERE loan_id = 'LOAN-251130-6613'"

df = pd.read_sql(query, conn)

conn.close()

df

,loan_id,period,payment_date,days_in_period,nominal_apr,opening_balance,interest_amount,repayment_amount,closing_balance,xirr_percent
0,LOAN-251130-6613,1,2025-12-30,30,7.705449,40000.00,253.33,695.56,39557.77,0.0
1,LOAN-251130-6613,2,2026-01-30,31,7.705449,39557.77,258.88,695.56,39121.09,0.0
2,LOAN-251130-6613,3,2026-02-28,29,7.705449,39121.09,239.50,695.56,38665.03,0.0
3,LOAN-251130-6613,4,2026-03-30,30,7.705449,38665.03,244.88,695.56,38214.35,0.0
4,LOAN-251130-6613,5,2026-04-30,31,7.705449,38214.35,250.09,695.56,37768.88,0.0
...,...,...,...,...,...,...,...,...,...,...
67,LOAN-251130-6613,68,2031-07-30,30,7.705449,3411.60,21.61,695.56,2737.65,0.0
68,LOAN-251130-6613,69,2031-08-30,31,7.705449,2737.65,17.92,695.56,2060.01,0.0
69,LOAN-251130-6613,70,2031-09-30,31,7.705449,2060.01,13.48,695.56,1377.93,0.0
70,LOAN-251130-6613,71,2031-10-30,30,7.705449,1377.93,8.73,695.56,691.10,0.0
71,LOAN-251130-6613,72,2031-11-30,31,7.705449,691.10,4.14,695.24,0.00,0.0

In [3]:
total = df[df['loan_id'] == 'LOAN-251130-6613']['interest_amount'].sum()

print(total)

10080.0